import pickle
from module import Class


class_list = [
    Class(51830, ["史锦曦", "奚子洋", "孙尚璟", "王振豪", "杨曦文"]),
    Class(61045, ["沈亦瑈", "姚梓芃", "徐志轩", "倪佳诚", "enzo", "费熙宸"]),
    Class(61300, ["陈祺然", "许家豪", "张霆琛", "计莹宸", "李晨瑶"]),
    Class(61445, ["金智轩", "傅宇阳", "曹韵泽", "许明浩", "朱苗荻"]),
    Class(61630, ["王子轩", "杨思涵", "金玮", "钟行易", "徐思齐", "赵千博", "王子敬"]),
    Class(70900, ["陈亦坤", "沈彦儒", "沈炜翔", "高涵宇", "张隽巍", "李致远"]),
    Class(71045, ["刘昊宸", "蔡秉桓", "庄子霄", "别家旭", "彭木铎", "陈梓萱", "周晟朗", "王楷煊"]),
    Class(71300, ["coco", "尹硕辰"]),
    Class(71630, ["孙慕丰", "孙子轩", "王子熠", "费毅浩", "姚诗茜", "jerry", "董亦宇"])
]

with open("class_data.dat", "wb") as f:
    pickle.dump(class_list, f)






